request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://example.com/producing-web-service">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getDateRequest>
            <gs:dateRequest>
                <gs:day>21</gs:day>
                <gs:month>09</gs:month>
                <gs:year>1998</gs:year>
            </gs:dateRequest>
        </gs:getDateRequest>
    </soapenv:Body>
</soapenv:Envelope>